<?php
    $blocks = array (
        'analytics_arts' => '#Анонс аналитических материалов\s*_{4,}([^_]*)#mu',
        'reg_info' => '#Нормативно-правовая информация\s*Последние изменения в законодательстве Республики Беларусь\s*Бухгалтеру\s*_{4,}\s([^_]*)Читайте на этой неделе#mu',
        'ann_analytics' => '#Читайте на этой неделе\s*_{4,}([^_]*)#mu',
        //'videochannel' => '#Видеоканал Нормативка.by\s*_{4,}([^_]*)#mu',
    //    'profby' => '#Семинары Prof\.by(.+)#smu',
    );

    $analytics_arts_portals = array(
        'buh' => '#(Бухгалтеру(.*))Кадровику#su',
        'kadr' => '#(Кадровику(.*))Юристу#su',
        'jur' => '#(Юристу(.*))#su',
    );

    $analytics_arts = array(
        'arts' => '#(?!=[А-Я]\.[А-Я]\.[А-Я][а-я]+).+?(?:(?=[А-Я]\.[А-Я]\.)|$)#su',
    );

    $reg_info_portals = array(
        'buh' => '#(Бухгалтеру|Бухгалтеру\s*_{4,}(.*))Экономисту#su',
        'eco' => '#(Экономисту(.*))Кадровику#su',
        'kadr' => '#(Кадровику(.*))Юристу#su',
        'jur' => '#(Юристу(.*))#su',
    );


    $reg_info_arts = array(
        'arts' => '#(.+)[\n\r]+(https://.+|http://.+)[\n\r]+#u',
    );

    $ann_analytics_portals = array(
        'buh' => '#(Бухгалтеру(.*))Кадровику#su',
        'kadr' => '#(Кадровику(.*))Юристу#su',
        'jur' => '#(Юристу(.*))#su',
    );

 /*   $videochannel = array(
        'last_releases' => '#((.*)Следующие выпуски)#su',
        'following_releases' => '#(Следующие выпуски(.*))#su',
    );*/